Documents/СписаниеСРасчетногоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СписаниеСРасчетногоСчета</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Спринт11_ОплатыПоСтатьямДДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеСРасчетногоСчета/Ext/ManagerModule.bsl
&ИзменениеИКонтроль("ПодготовитьПараметрыПроведения")
Функция Спринт11_ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ, ДоговорДляОтложенногоПроведения)

	ВалютаРеглУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	ЭтоОтложенноеПроведение = ЗначениеЗаполнено(ДоговорДляОтложенногоПроведения);

	ПараметрыПроведения = Новый Структура;
	ПараметрыПроведения.Вставить("ВалютаРеглУчета", ВалютаРеглУчета);
	ПараметрыПроведения.Вставить("ДокументСсылка",  ДокументСсылка);
	ПараметрыПроведения.Вставить("ЭтоОтложенноеПроведение", ЭтоОтложенноеПроведение);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка",          ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРеглУчета);
	Запрос.УстановитьПараметр("ЭтоОтложенноеПроведение",         ЭтоОтложенноеПроведение);
	Запрос.УстановитьПараметр("ДоговорДляОтложенногоПроведения", ДоговорДляОтложенногоПроведения);

	ПодготовитьПараметрыРеквизитыДокумента(Запрос, ПараметрыПроведения, Отказ);

	Реквизиты = ПараметрыПроведения.ТаблицаРеквизиты[0];
	Если Отказ ИЛИ НЕ УчетнаяПолитика.Существует(Реквизиты.Организация, Реквизиты.Дата, Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;

	ПлательщикНДФЛ = УчетнаяПолитика.ПлательщикНДФЛ(Реквизиты.Организация, Реквизиты.Дата);
	ПрименяетсяАУСН = УчетнаяПолитика.ПрименяетсяАУСН(Реквизиты.Организация, Реквизиты.Дата);
	НалогАУСН = Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоВиду(Перечисления.ВидыНалогов.АУСН);
	СчетАУСН = Справочники.ВидыНалоговИПлатежейВБюджет.СчетУчета(НалогАУСН, Реквизиты.Дата);

	ПараметрыПроведения.Вставить("ПлательщикНДФЛ", ПлательщикНДФЛ);
	ПараметрыПроведения.Вставить("ПрименяетсяАУСН", ПрименяетсяАУСН);

	Запрос.УстановитьПараметр("ПлательщикНДФЛ",                 ПлательщикНДФЛ);
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСН",        УчетнаяПолитика.ПрименяетсяУСН(
	Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСНПатент",  УчетнаяПолитика.ПрименяетсяУСНПатент(
	Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("ВестиУчетПоВидамДеятельностиИП", УчетнаяПолитика.ВестиУчетПоВидамДеятельностиИП(
	Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("ОсновнаяНоменклатурнаяГруппа",   УчетнаяПолитика.ОсновнаяНоменклатурнаяГруппа(
	Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("ДокументВВалюте",                Реквизиты.ВалютаДокумента <> ВалютаРеглУчета);
	Запрос.УстановитьПараметр("РасходыНаУслугиБанков",          ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
	"Справочник.ПрочиеДоходыИРасходы.РасходыНаУслугиБанков"));
	Запрос.УстановитьПараметр("ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств", УчетнаяПолитика.ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств(
	Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("РеестрВыплатСамозанятым",       Реквизиты.РеестрВыплатСамозанятым);
	Запрос.УстановитьПараметр("СчетАУСН", СчетАУСН);
	Запрос.УстановитьПараметр(
	"СодержаниеНачислениеАУСН", СтрШаблон(НСтр("ru = '%1 : начислено'"), Реквизиты.Содержание));
	Если Реквизиты.БезЗакрывающихДокументов Тогда
		Запрос.УстановитьПараметр("ОсновнойСчетУчетаЗатрат", УчетнаяПолитика.ОсновнойСчетУчетаЗатрат(
		Реквизиты.Организация, Реквизиты.Дата));
		Запрос.УстановитьПараметр("ОсновнаяСтатьяЗатрат", Справочники.СтатьиЗатрат.ОсновнаяСтатьяЗатрат());
		Запрос.УстановитьПараметр("ОсновноеПодразделение", 
		БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации"));
		Запрос.УстановитьПараметр("ПрочиеВнереализационныеДоходыРасходы",
		ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.ПрочиеВнереализационныеДоходыРасходы"));
	КонецЕсли;

	Для каждого Колонка Из ПараметрыПроведения.ТаблицаРеквизиты.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;

	НомераТаблиц = Новый Структура;

	Запрос.Текст = ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
	+ ТекстЗапросаТаблицыДокумента(НомераТаблиц,         ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПогашениеЗадолженности(НомераТаблиц,   ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПрочееСписание(НомераТаблиц,           ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПоступлениеМПЗИП(НомераТаблиц,         ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеНалогаИП(НомераТаблиц,     ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеЗарплаты(НомераТаблиц,     ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеДепонентов(НомераТаблиц,   ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаОплатаСчетов(НомераТаблиц,             ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаОплатаПоДоговорамПодряда(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаРегистрацияОтложенныхРасчетовСКонтрагентами(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеНДФЛ(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеДивидендов(НомераТаблиц,   ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаВыплатыСамозанятым(НомераТаблиц,   ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеПоИсполнительномуЛистуРаботника(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаДанныеРазметкиАУСН(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаДанныеРасчетаНДФЛАУСН(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаРазметкаАУСНБанка(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	#Вставка
	//+ Иващенко Андрей
	// Добавляем текст запроса для движения по регистру Спринт11_ОплатыПоСтатьямДДС
	+ТекстЗапросаСпринт11_ОплатыПоСтатьямДДС(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	//- Иващенко Андрей
	#КонецВставки
	;

	Результат = Запрос.ВыполнитьПакет();

	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;

	Если Реквизиты.ЭтоВыплатаЗарплаты Тогда
		ТаблицыОплатыТруда = ПолучитьТаблицыОплатыТруда(ПараметрыПроведения, ДокументСсылка);
		Если ТаблицыОплатыТруда <> Неопределено Тогда
			ПараметрыПроведения.Вставить("ПеречислениеЗарплаты", ТаблицыОплатыТруда);
		КонецЕсли;
	ИначеЕсли Реквизиты.ЭтоВыплатаПоДоговоруПодряда Тогда
		ТаблицыОплатыДоговоровПодряда = ПолучитьТаблицыОплатыДоговоровПодряда(ПараметрыПроведения, ДокументСсылка);
		Если ТаблицыОплатыДоговоровПодряда <> Неопределено Тогда
			ПараметрыПроведения.Вставить("ОплатаПоДоговорамПодряда", ТаблицыОплатыДоговоровПодряда);
		КонецЕсли;
	КонецЕсли;

	Реквизиты = ПараметрыПроведения.Реквизиты[0];
	Реквизиты.Содержание = ТекстСодержанияПроводокДокумента(Реквизиты);
	Если ПараметрыПроведения.РасшифровкаПлатежа <> Неопределено Тогда
		ПараметрыПроведения.РасшифровкаПлатежа.ЗаполнитьЗначения(Реквизиты.Содержание, "Содержание");
	КонецЕсли;
	Если ПараметрыПроведения.РасшифровкаПлатежаПрочее <> Неопределено Тогда
		Для Каждого Строка Из ПараметрыПроведения.РасшифровкаПлатежаПрочее Цикл
			Если Не ЗначениеЗаполнено(Строка.Содержание) Тогда
				Строка.Содержание = Реквизиты.Содержание;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат ПараметрыПроведения;

КонецФункции

Функция ТекстЗапросаСпринт11_ОплатыПоСтатьямДДС(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ Реквизиты.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику Тогда
		ПараметрыПроведения.Вставить("Спринт11_ОплатыПоСтатьямДДС", Неопределено);
		Возврат "";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СписаниеСРасчетногоСчета.Дата КАК Период,
		|	СписаниеСРасчетногоСчета.Контрагент КАК Контрагент,
		|	СписаниеСРасчетногоСчета.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.Спринт11_Ответственный КАК Ответственный,
		|	СУММА(СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СуммаВзаиморасчетов) КАК Сумма
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета.РасшифровкаПлатежа КАК СписаниеСРасчетногоСчетаРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|		ПО СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Ссылка = СписаниеСРасчетногоСчета.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеСРасчетногоСчета.Дата,
		|	СписаниеСРасчетногоСчета.Контрагент,
		|	СписаниеСРасчетногоСчета.ДоговорКонтрагента,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.Спринт11_Ответственный";
		
		НомераТаблиц.Вставить("Спринт11_ОплатыПоСтатьямДДС", НомераТаблиц.Количество());
		
		Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
		
	КонецЕсли;
	
КонецФункции
